consumir_middleware_exemplos/benchmark_alimentadb/resultados_nao_usados/teste_500_write/bench_only.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Target transaction rate: 5/sec
Report intermediate results every 2 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 2s ] thds: 8 tps: 6.49 qps: 38.95 (r/w/o: 0.00/25.97/12.98) lat (ms,95%): 43.39 err/s: 0.00 reconn/s: 0.00
[ 2s ] queue length: 0, concurrency: 0
[ 4s ] thds: 8 tps: 6.50 qps: 41.51 (r/w/o: 0.00/28.01/13.50) lat (ms,95%): 74.46 err/s: 0.00 reconn/s: 0.00
[ 4s ] queue length: 0, concurrency: 1
[ 6s ] thds: 8 tps: 6.50 qps: 36.50 (r/w/o: 0.00/24.00/12.50) lat (ms,95%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 6s ] queue length: 0, concurrency: 0
[ 8s ] thds: 8 tps: 6.00 qps: 36.00 (r/w/o: 0.00/24.00/12.00) lat (ms,95%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 8s ] queue length: 0, concurrency: 0
[ 10s ] thds: 8 tps: 8.00 qps: 48.00 (r/w/o: 0.00/32.00/16.00) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 10s ] queue length: 0, concurrency: 0
[ 12s ] thds: 8 tps: 4.00 qps: 24.00 (r/w/o: 0.00/16.00/8.00) lat (ms,95%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 12s ] queue length: 0, concurrency: 0
[ 14s ] thds: 8 tps: 5.00 qps: 30.00 (r/w/o: 0.00/20.00/10.00) lat (ms,95%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 14s ] queue length: 0, concurrency: 0
[ 16s ] thds: 8 tps: 5.00 qps: 30.00 (r/w/o: 0.00/20.00/10.00) lat (ms,95%): 104.84 err/s: 0.00 reconn/s: 0.00
[ 16s ] queue length: 0, concurrency: 0
[ 18s ] thds: 8 tps: 7.00 qps: 42.00 (r/w/o: 0.00/28.00/14.00) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 18s ] queue length: 0, concurrency: 0
[ 20s ] thds: 8 tps: 6.00 qps: 36.00 (r/w/o: 0.00/24.00/12.00) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 20s ] queue length: 0, concurrency: 0
[ 22s ] thds: 8 tps: 4.00 qps: 24.00 (r/w/o: 0.00/16.00/8.00) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 22s ] queue length: 0, concurrency: 0
[ 24s ] thds: 8 tps: 4.50 qps: 29.50 (r/w/o: 0.00/20.00/9.50) lat (ms,95%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 24s ] queue length: 0, concurrency: 1
[ 26s ] thds: 8 tps: 6.00 qps: 36.50 (r/w/o: 0.00/24.00/12.50) lat (ms,95%): 43.39 err/s: 0.00 reconn/s: 0.00
[ 26s ] queue length: 0, concurrency: 2
[ 28s ] thds: 8 tps: 6.00 qps: 33.00 (r/w/o: 0.00/22.00/11.00) lat (ms,95%): 43.39 err/s: 0.00 reconn/s: 0.00
[ 28s ] queue length: 0, concurrency: 0
[ 30s ] thds: 8 tps: 4.50 qps: 27.00 (r/w/o: 0.00/18.00/9.00) lat (ms,95%): 65.65 err/s: 0.00 reconn/s: 0.00
[ 30s ] queue length: 0, concurrency: 0
[ 32s ] thds: 8 tps: 2.00 qps: 12.00 (r/w/o: 0.00/8.00/4.00) lat (ms,95%): 97.55 err/s: 0.00 reconn/s: 0.00
[ 32s ] queue length: 0, concurrency: 0
[ 34s ] thds: 8 tps: 5.50 qps: 36.50 (r/w/o: 0.00/24.50/12.00) lat (ms,95%): 62.19 err/s: 0.00 reconn/s: 0.00
[ 34s ] queue length: 0, concurrency: 2
[ 36s ] thds: 8 tps: 6.50 qps: 40.00 (r/w/o: 0.00/26.50/13.50) lat (ms,95%): 61.08 err/s: 0.50 reconn/s: 0.00
[ 36s ] queue length: 0, concurrency: 2
[ 38s ] thds: 8 tps: 4.50 qps: 26.00 (r/w/o: 0.00/17.50/8.50) lat (ms,95%): 127.81 err/s: 0.00 reconn/s: 0.00
[ 38s ] queue length: 0, concurrency: 1
[ 40s ] thds: 8 tps: 5.00 qps: 30.00 (r/w/o: 0.00/20.00/10.00) lat (ms,95%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 40s ] queue length: 0, concurrency: 1
[ 42s ] thds: 8 tps: 4.50 qps: 24.50 (r/w/o: 0.00/16.00/8.50) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 42s ] queue length: 0, concurrency: 0
[ 44s ] thds: 8 tps: 2.00 qps: 12.00 (r/w/o: 0.00/8.00/4.00) lat (ms,95%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 44s ] queue length: 0, concurrency: 0
[ 46s ] thds: 8 tps: 7.00 qps: 42.00 (r/w/o: 0.00/28.00/14.00) lat (ms,95%): 116.80 err/s: 0.00 reconn/s: 0.00
[ 46s ] queue length: 0, concurrency: 0
[ 48s ] thds: 8 tps: 0.50 qps: 3.00 (r/w/o: 0.00/2.00/1.00) lat (ms,95%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 48s ] queue length: 0, concurrency: 0
[ 50s ] thds: 8 tps: 7.00 qps: 44.50 (r/w/o: 0.00/30.00/14.50) lat (ms,95%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 50s ] queue length: 0, concurrency: 1
[ 52s ] thds: 8 tps: 7.00 qps: 39.50 (r/w/o: 0.00/26.00/13.50) lat (ms,95%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 52s ] queue length: 0, concurrency: 0
[ 54s ] thds: 8 tps: 6.00 qps: 36.00 (r/w/o: 0.00/24.00/12.00) lat (ms,95%): 74.46 err/s: 0.00 reconn/s: 0.00
[ 54s ] queue length: 0, concurrency: 0
[ 56s ] thds: 8 tps: 3.50 qps: 21.00 (r/w/o: 0.00/14.00/7.00) lat (ms,95%): 68.05 err/s: 0.00 reconn/s: 0.00
[ 56s ] queue length: 0, concurrency: 0
[ 58s ] thds: 8 tps: 3.50 qps: 21.00 (r/w/o: 0.00/14.00/7.00) lat (ms,95%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 58s ] queue length: 0, concurrency: 0
[ 60s ] thds: 8 tps: 2.50 qps: 15.00 (r/w/o: 0.00/10.00/5.00) lat (ms,95%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 60s ] queue length: 0, concurrency: 0
[ 62s ] thds: 8 tps: 3.50 qps: 21.00 (r/w/o: 0.00/14.00/7.00) lat (ms,95%): 59.99 err/s: 0.00 reconn/s: 0.00
[ 62s ] queue length: 0, concurrency: 0
[ 64s ] thds: 8 tps: 3.50 qps: 21.00 (r/w/o: 0.00/14.00/7.00) lat (ms,95%): 110.66 err/s: 0.00 reconn/s: 0.00
[ 64s ] queue length: 0, concurrency: 0
[ 66s ] thds: 8 tps: 4.50 qps: 29.50 (r/w/o: 0.00/20.00/9.50) lat (ms,95%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 66s ] queue length: 0, concurrency: 1
[ 68s ] thds: 8 tps: 6.50 qps: 36.50 (r/w/o: 0.00/24.00/12.50) lat (ms,95%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 68s ] queue length: 0, concurrency: 0
[ 70s ] thds: 8 tps: 2.50 qps: 15.00 (r/w/o: 0.00/10.00/5.00) lat (ms,95%): 170.48 err/s: 0.00 reconn/s: 0.00
[ 70s ] queue length: 0, concurrency: 0
[ 72s ] thds: 8 tps: 5.00 qps: 32.50 (r/w/o: 0.00/22.00/10.50) lat (ms,95%): 42.61 err/s: 0.00 reconn/s: 0.00
[ 72s ] queue length: 0, concurrency: 1
[ 74s ] thds: 8 tps: 7.50 qps: 45.00 (r/w/o: 0.00/30.00/15.00) lat (ms,95%): 94.10 err/s: 0.00 reconn/s: 0.00
[ 74s ] queue length: 0, concurrency: 2
[ 76s ] thds: 8 tps: 5.50 qps: 30.50 (r/w/o: 0.00/20.00/10.50) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 76s ] queue length: 0, concurrency: 0
[ 78s ] thds: 8 tps: 4.00 qps: 24.00 (r/w/o: 0.00/16.00/8.00) lat (ms,95%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 78s ] queue length: 0, concurrency: 0
[ 80s ] thds: 8 tps: 5.00 qps: 32.50 (r/w/o: 0.00/22.00/10.50) lat (ms,95%): 102.97 err/s: 0.00 reconn/s: 0.00
[ 80s ] queue length: 0, concurrency: 1
[ 82s ] thds: 8 tps: 6.00 qps: 33.50 (r/w/o: 0.00/22.00/11.50) lat (ms,95%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 82s ] queue length: 0, concurrency: 0
[ 84s ] thds: 8 tps: 3.50 qps: 21.00 (r/w/o: 0.00/14.00/7.00) lat (ms,95%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 84s ] queue length: 0, concurrency: 0
[ 86s ] thds: 8 tps: 3.50 qps: 21.00 (r/w/o: 0.00/14.00/7.00) lat (ms,95%): 114.72 err/s: 0.00 reconn/s: 0.00
[ 86s ] queue length: 0, concurrency: 0
[ 88s ] thds: 8 tps: 5.50 qps: 33.00 (r/w/o: 0.00/22.00/11.00) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 88s ] queue length: 0, concurrency: 0
[ 90s ] thds: 8 tps: 5.00 qps: 30.00 (r/w/o: 0.00/20.00/10.00) lat (ms,95%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 90s ] queue length: 0, concurrency: 0
[ 92s ] thds: 8 tps: 3.50 qps: 21.00 (r/w/o: 0.00/14.00/7.00) lat (ms,95%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 92s ] queue length: 0, concurrency: 0
[ 94s ] thds: 8 tps: 5.50 qps: 33.00 (r/w/o: 0.00/22.00/11.00) lat (ms,95%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 94s ] queue length: 0, concurrency: 0
[ 96s ] thds: 8 tps: 4.50 qps: 27.00 (r/w/o: 0.00/18.00/9.00) lat (ms,95%): 196.89 err/s: 0.00 reconn/s: 0.00
[ 96s ] queue length: 0, concurrency: 0
[ 98s ] thds: 8 tps: 6.50 qps: 39.00 (r/w/o: 0.00/26.00/13.00) lat (ms,95%): 66.84 err/s: 0.00 reconn/s: 0.00
[ 98s ] queue length: 0, concurrency: 0
[ 100s ] thds: 8 tps: 3.50 qps: 21.00 (r/w/o: 0.00/14.00/7.00) lat (ms,95%): 71.83 err/s: 0.00 reconn/s: 0.00
[ 100s ] queue length: 0, concurrency: 0
[ 102s ] thds: 8 tps: 4.50 qps: 27.00 (r/w/o: 0.00/18.00/9.00) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 102s ] queue length: 0, concurrency: 0
[ 104s ] thds: 8 tps: 4.50 qps: 27.00 (r/w/o: 0.00/18.00/9.00) lat (ms,95%): 99.33 err/s: 0.00 reconn/s: 0.00
[ 104s ] queue length: 0, concurrency: 0
[ 106s ] thds: 8 tps: 5.00 qps: 30.00 (r/w/o: 0.00/20.00/10.00) lat (ms,95%): 114.72 err/s: 0.00 reconn/s: 0.00
[ 106s ] queue length: 0, concurrency: 0
[ 108s ] thds: 8 tps: 7.50 qps: 47.50 (r/w/o: 0.00/32.00/15.50) lat (ms,95%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 108s ] queue length: 0, concurrency: 1
[ 110s ] thds: 8 tps: 5.00 qps: 27.50 (r/w/o: 0.00/18.00/9.50) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 110s ] queue length: 0, concurrency: 0
[ 112s ] thds: 8 tps: 1.50 qps: 9.00 (r/w/o: 0.00/6.00/3.00) lat (ms,95%): 42.61 err/s: 0.00 reconn/s: 0.00
[ 112s ] queue length: 0, concurrency: 0
[ 114s ] thds: 8 tps: 6.00 qps: 38.49 (r/w/o: 0.00/26.00/12.50) lat (ms,95%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 114s ] queue length: 0, concurrency: 1
[ 116s ] thds: 8 tps: 3.50 qps: 18.50 (r/w/o: 0.00/12.00/6.50) lat (ms,95%): 77.19 err/s: 0.00 reconn/s: 0.00
[ 116s ] queue length: 0, concurrency: 0
[ 118s ] thds: 8 tps: 1.50 qps: 9.00 (r/w/o: 0.00/6.00/3.00) lat (ms,95%): 53.85 err/s: 0.00 reconn/s: 0.00
[ 118s ] queue length: 0, concurrency: 0
[ 120s ] thds: 8 tps: 2.00 qps: 12.00 (r/w/o: 0.00/8.00/4.00) lat (ms,95%): 62.19 err/s: 0.00 reconn/s: 0.00
[ 120s ] queue length: 0, concurrency: 0
[ 122s ] thds: 8 tps: 3.50 qps: 21.00 (r/w/o: 0.00/14.00/7.00) lat (ms,95%): 77.19 err/s: 0.00 reconn/s: 0.00
[ 122s ] queue length: 0, concurrency: 0
[ 124s ] thds: 8 tps: 3.00 qps: 18.00 (r/w/o: 0.00/12.00/6.00) lat (ms,95%): 104.84 err/s: 0.00 reconn/s: 0.00
[ 124s ] queue length: 0, concurrency: 0
[ 126s ] thds: 8 tps: 4.50 qps: 27.00 (r/w/o: 0.00/18.00/9.00) lat (ms,95%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 126s ] queue length: 0, concurrency: 0
[ 128s ] thds: 8 tps: 5.00 qps: 32.50 (r/w/o: 0.00/22.00/10.50) lat (ms,95%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 128s ] queue length: 0, concurrency: 1
[ 130s ] thds: 8 tps: 7.00 qps: 39.50 (r/w/o: 0.00/26.00/13.50) lat (ms,95%): 87.56 err/s: 0.00 reconn/s: 0.00
[ 130s ] queue length: 0, concurrency: 0
[ 132s ] thds: 8 tps: 5.50 qps: 33.00 (r/w/o: 0.00/22.00/11.00) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 132s ] queue length: 0, concurrency: 0
[ 134s ] thds: 8 tps: 3.50 qps: 21.00 (r/w/o: 0.00/14.00/7.00) lat (ms,95%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 134s ] queue length: 0, concurrency: 0
[ 136s ] thds: 8 tps: 4.50 qps: 27.00 (r/w/o: 0.00/18.00/9.00) lat (ms,95%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 136s ] queue length: 0, concurrency: 0
[ 138s ] thds: 8 tps: 4.50 qps: 27.00 (r/w/o: 0.00/18.00/9.00) lat (ms,95%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 138s ] queue length: 0, concurrency: 0
[ 140s ] thds: 8 tps: 4.50 qps: 27.00 (r/w/o: 0.00/18.00/9.00) lat (ms,95%): 223.34 err/s: 0.00 reconn/s: 0.00
[ 140s ] queue length: 0, concurrency: 0
[ 142s ] thds: 8 tps: 3.50 qps: 21.00 (r/w/o: 0.00/14.00/7.00) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 142s ] queue length: 0, concurrency: 0
[ 144s ] thds: 8 tps: 3.00 qps: 20.50 (r/w/o: 0.00/14.00/6.50) lat (ms,95%): 95.81 err/s: 0.00 reconn/s: 0.00
[ 144s ] queue length: 0, concurrency: 1
[ 146s ] thds: 8 tps: 9.00 qps: 52.50 (r/w/o: 0.00/34.50/18.00) lat (ms,95%): 56.84 err/s: 0.50 reconn/s: 0.00
[ 146s ] queue length: 0, concurrency: 0
[ 148s ] thds: 8 tps: 6.50 qps: 39.00 (r/w/o: 0.00/26.00/13.00) lat (ms,95%): 55.82 err/s: 0.00 reconn/s: 0.00
[ 148s ] queue length: 0, concurrency: 0
[ 150s ] thds: 8 tps: 4.00 qps: 24.00 (r/w/o: 0.00/16.00/8.00) lat (ms,95%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 150s ] queue length: 0, concurrency: 0
[ 152s ] thds: 8 tps: 3.50 qps: 23.50 (r/w/o: 0.00/16.00/7.50) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 152s ] queue length: 0, concurrency: 1
[ 154s ] thds: 8 tps: 4.00 qps: 21.50 (r/w/o: 0.00/14.00/7.50) lat (ms,95%): 118.92 err/s: 0.00 reconn/s: 0.00
[ 154s ] queue length: 0, concurrency: 0
[ 156s ] thds: 8 tps: 6.00 qps: 36.00 (r/w/o: 0.00/24.00/12.00) lat (ms,95%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 156s ] queue length: 0, concurrency: 0
[ 158s ] thds: 8 tps: 5.00 qps: 30.00 (r/w/o: 0.00/20.00/10.00) lat (ms,95%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 158s ] queue length: 0, concurrency: 0
[ 160s ] thds: 8 tps: 6.00 qps: 36.00 (r/w/o: 0.00/24.00/12.00) lat (ms,95%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 160s ] queue length: 0, concurrency: 0
[ 162s ] thds: 8 tps: 3.50 qps: 21.00 (r/w/o: 0.00/14.00/7.00) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 162s ] queue length: 0, concurrency: 0
[ 164s ] thds: 8 tps: 4.50 qps: 27.00 (r/w/o: 0.00/18.00/9.00) lat (ms,95%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 164s ] queue length: 0, concurrency: 0
[ 166s ] thds: 8 tps: 5.00 qps: 32.50 (r/w/o: 0.00/22.00/10.50) lat (ms,95%): 53.85 err/s: 0.00 reconn/s: 0.00
[ 166s ] queue length: 0, concurrency: 1
[ 168s ] thds: 8 tps: 7.50 qps: 42.50 (r/w/o: 0.00/28.00/14.50) lat (ms,95%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 168s ] queue length: 0, concurrency: 0
[ 170s ] thds: 8 tps: 4.00 qps: 24.00 (r/w/o: 0.00/16.00/8.00) lat (ms,95%): 114.72 err/s: 0.00 reconn/s: 0.00
[ 170s ] queue length: 0, concurrency: 0
[ 172s ] thds: 8 tps: 5.00 qps: 30.00 (r/w/o: 0.00/20.00/10.00) lat (ms,95%): 80.03 err/s: 0.00 reconn/s: 0.00
[ 172s ] queue length: 0, concurrency: 0
[ 174s ] thds: 8 tps: 4.50 qps: 27.00 (r/w/o: 0.00/18.00/9.00) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 174s ] queue length: 0, concurrency: 0
[ 176s ] thds: 8 tps: 3.00 qps: 18.00 (r/w/o: 0.00/12.00/6.00) lat (ms,95%): 54.83 err/s: 0.00 reconn/s: 0.00
[ 176s ] queue length: 0, concurrency: 0
[ 178s ] thds: 8 tps: 4.50 qps: 27.00 (r/w/o: 0.00/18.00/9.00) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 178s ] queue length: 0, concurrency: 0
[ 180s ] thds: 8 tps: 4.50 qps: 27.00 (r/w/o: 0.00/18.00/9.00) lat (ms,95%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 180s ] queue length: 0, concurrency: 0
[ 182s ] thds: 8 tps: 4.50 qps: 27.00 (r/w/o: 0.00/18.00/9.00) lat (ms,95%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 182s ] queue length: 0, concurrency: 0
[ 184s ] thds: 8 tps: 4.50 qps: 29.00 (r/w/o: 0.00/19.50/9.50) lat (ms,95%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 184s ] queue length: 0, concurrency: 1
[ 186s ] thds: 8 tps: 5.50 qps: 31.00 (r/w/o: 0.00/20.50/10.50) lat (ms,95%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 186s ] queue length: 0, concurrency: 0
[ 188s ] thds: 8 tps: 6.50 qps: 41.50 (r/w/o: 0.00/28.00/13.50) lat (ms,95%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 188s ] queue length: 0, concurrency: 1
[ 190s ] thds: 8 tps: 6.50 qps: 36.50 (r/w/o: 0.00/24.00/12.50) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 190s ] queue length: 0, concurrency: 0
[ 192s ] thds: 8 tps: 4.50 qps: 27.00 (r/w/o: 0.00/18.00/9.00) lat (ms,95%): 62.19 err/s: 0.00 reconn/s: 0.00
[ 192s ] queue length: 0, concurrency: 0
[ 194s ] thds: 8 tps: 5.00 qps: 30.00 (r/w/o: 0.00/20.00/10.00) lat (ms,95%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 194s ] queue length: 0, concurrency: 0
[ 196s ] thds: 8 tps: 7.50 qps: 45.00 (r/w/o: 0.00/30.00/15.00) lat (ms,95%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 196s ] queue length: 0, concurrency: 0
[ 198s ] thds: 8 tps: 3.00 qps: 18.00 (r/w/o: 0.00/12.00/6.00) lat (ms,95%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 198s ] queue length: 0, concurrency: 0
[ 200s ] thds: 8 tps: 4.50 qps: 27.00 (r/w/o: 0.00/18.00/9.00) lat (ms,95%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 200s ] queue length: 0, concurrency: 0
SQL statistics:
    queries performed:
        read:                            0
        write:                           3858
        other:                           1930
        total:                           5788
    transactions:                        964    (4.82 per sec.)
    queries:                             5788   (28.91 per sec.)
    ignored errors:                      2      (0.01 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          200.1714s
    total number of events:              964

Latency (ms):
         min:                                   18.68
         avg:                                   37.21
         max:                                  224.24
         95th percentile:                       84.47
         sum:                                35868.16

Threads fairness:
    events (avg/stddev):           120.5000/0.50
    execution time (avg/stddev):   4.4835/0.11